In [48]:
import pandas as pd

In [49]:
df = pd.read_csv("stock_data.csv", header=1, names=["stock_symbol", "eps", "revenue", "price", "people"])
df.head(4)

  stock_symbol            eps  revenue price         people
0        GOOGL          27.82       87   845     larry page
1          WMT           4.61      484    65           n.a.
2         MSFT             -1       85    64     bill gates
3         RIL   not available       50  1023  mukesh ambani

In [50]:
df = pd.read_csv("stock_data.csv", header=1, nrows=2)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [51]:
# df_xl = pd.read_excel("movies_db.xlsx")

In [52]:
df = pd.read_csv("stock_data.csv", header=1, nrows=2)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [53]:
df = pd.read_csv("stock_data.csv", header=1, na_values={
    "eps": ["not available"],
    "revenue":[ -1],
    "price": ["n.a."],
    "people":["n.a."]
})
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [54]:
df = pd.read_csv("stock_data.csv", header=1, na_values=["not available", -1, "n.a."])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [55]:
df["pe"] = df.price/df.eps

In [56]:
df.head(4)

  tickers    eps  revenue   price         people         pe
0   GOOGL  27.82     87.0   845.0     larry page  30.373832
1     WMT   4.61    484.0    65.0            NaN  14.099783
2    MSFT    NaN     85.0    64.0     bill gates        NaN
3    RIL     NaN     50.0  1023.0  mukesh ambani        NaN

In [62]:
df.to_csv("pe1.csv", index = False)

In [63]:
pd.read_csv("pe1.csv")

  tickers    eps  revenue   price         people         pe
0   GOOGL  27.82     87.0   845.0     larry page  30.373832
1     WMT   4.61    484.0    65.0            NaN  14.099783
2    MSFT    NaN     85.0    64.0     bill gates        NaN
3    RIL     NaN     50.0  1023.0  mukesh ambani        NaN
4    TATA   5.60      NaN     NaN     ratan tata        NaN

In [ ]:
# pip install openpyxl

In [69]:
df_movies = pd.read_excel("movies_db.xlsx", "movies") # Here movies mentioning the sheet name

In [71]:
df_movies.head(5)

,movie_id,title,industry,release_year,imdb_rating,studio,language_id
0,101,K.G.F: Chapter 2,Bollywood,2022,8.4,Hombale Films,3
1,102,Doctor Strange in the Multiverse of Madness,Hollywood,2022,7.0,Marvel Studios,5
2,103,Thor: The Dark World,Hollywood,2013,6.8,Marvel Studios,5
3,104,Thor: Ragnarok,Hollywood,2017,7.9,Marvel Studios,5
4,105,Thor: Love and Thunder,Hollywood,2022,6.8,Marvel Studios,5

In [72]:
df_financials = pd.read_excel("movies_db.xlsx", "financials")

In [73]:
df_financials.head(5)

   movie_id  budget  revenue      unit currency
0       101     1.0     12.5  Billions      INR
1       102   200.0    954.8  Millions      USD
2       103   165.0    644.8  Millions       $$
3       104   180.0    854.0  Millions  Dollars
4       105   250.0    670.0  Millions      USD

In [77]:
def std_currency(curr):
    if curr == "$$" or curr == "Dollars":
        return "USD"
    return curr

In [78]:
df_financials = pd.read_excel("movies_db.xlsx", "financials", converters={
    "currency": std_currency
})

In [79]:
df_financials.head(5)

   movie_id  budget  revenue      unit currency
0       101     1.0     12.5  Billions      INR
1       102   200.0    954.8  Millions      USD
2       103   165.0    644.8  Millions      USD
3       104   180.0    854.0  Millions      USD
4       105   250.0    670.0  Millions      USD

In [84]:
df_merged = pd.merge(df_movies, df_financials, on="movie_id")

In [86]:
df_merged.to_excel("movies_merged.xlsx", sheet_name="merged", index=False)

In [91]:
df_person = pd.DataFrame({
    "name": ["Minhaz", "monir", "kamrul"],
    "age": [28, 31, 34]
})
df_person

     name  age
0  Minhaz   28
1   monir   31
2  kamrul   34

In [92]:
df_education = pd.DataFrame({
    "institute": ["SUST", "CUET", "BR"],
    "Year": [2016, 2014, 2011]
})
df_education

  institute  Year
0      SUST  2016
1      CUET  2014
2        BR  2011

In [95]:
with pd.ExcelWriter("person_institute.xlsx") as writer:
    df_person.to_excel(writer, sheet_name="person", index=False)
    df_education.to_excel(writer, sheet_name="education", index=False)